================================================================================
type definitions
================================================================================
///hello
/// here
type X
--------------------------------------------------------------------------------

(structure
  (comment)
  (comment)
  (statement_expression
    (type_definition
      (identifier
        (uppercase_identifier)))))

================================================================================
struct definitions
================================================================================
///hello
/// struct
struct X {}
--------------------------------------------------------------------------------

(structure
  (comment)
  (comment)
  (statement_expression
    (struct_definition
      (identifier
        (uppercase_identifier)))))

================================================================================
enum definitions
================================================================================
///hello
/// enum
enum X {}
--------------------------------------------------------------------------------

(structure
  (comment)
  (comment)
  (statement_expression
    (enum_definition
      (identifier
        (uppercase_identifier)))))

================================================================================
fn definitions
================================================================================
///hello
/// fn
fn x {}
--------------------------------------------------------------------------------

(structure
  (comment)
  (comment)
  (statement_expression
    (named_matrix_expression
      (function_identifier
        (lowercase_identifier)))))

================================================================================
trait definitions
================================================================================
///hello
/// trait
// comment
//comment
trait X {}
--------------------------------------------------------------------------------

(structure
  (comment)
  (comment)
  (comment)
  (comment)
  (statement_expression
    (trait_definition
      (identifier
        (uppercase_identifier)))))
